       identification division.
       program-id. HELLO.
       data division.
       working-storage section.
       procedure division.
       display "HELLO, WORLD!".
       stop run.
       