       02 customer-id                      PIC X(10).
       02 account-id                       PIC X(10).
       02 account-type                     PIC X(20).
       02 balance                          PIC ZZZZZZ9V99.
       02 valuta-id                        PIC X(3).
       